// - створити функцію яка обчислює та повертає площу прямокутника висотою 8
function calc (a, b) {
    return a * b;
}

let calc1 = calc(5,7);
console.log(calc1);

// - створити функцію яка обчислює та повертає площу кола
//r=8
function circle (b) {
    const a = 3.14;
    return a * (b * b);
}
let circle1 = circle(8);
console.log(circle1);

// - створити функцію яка обчислює та повертає площу циліндру
//R-6 h-8
//S=2πR(h+R)
function cylinder (r, h) {
    const p = 3.14;
    return 2 * p * r * (h+r);
}
cylinder1 = cylinder(6, 8)
console.log(cylinder1);

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);

function cifr (a, b){
    let numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
    let slice = numbers.slice(2,5);

}

console.log(slice);




    // - створити функцію яка  створює блок з текстом. Текст задати через аргумент
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
